Revit 2027 API
BuiltInFailures.ImportFailures.ImportContainedUnsupportedTransform Property
 The imported geometry contains transformations which Revit does not support. Some objects may be displaced or distorted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ImportContainedUnsupportedTransform { get; }
Public Shared ReadOnly Property ImportContainedUnsupportedTransform As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ImportContainedUnsupportedTransform {
	FailureDefinitionId^ get ();
}
static member ImportContainedUnsupportedTransform : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace